NERS570_project/system/controlDict
/*--------------------------------*- C++ -*---------------------------------*\ 
| ========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  v1812                                 | 
|   \  /    A nd           | Web:      www.OpenFOAM.com                      | 
|    \/     M anipulation  |                                                 | 
\*--------------------------------------------------------------------------*/ 
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
libs
(
    "libOpenFOAM.so"
    "libincompressibleTurbulenceModels.so"
);
application     simpleFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         1000;
deltaT          1;
writeControl    timeStep;
writeInterval   1000;
purgeWrite      0;
writeFormat     ascii;
writePrecision  16;
writeCompression off;
timeFormat      general;
timePrecision   16;
runTimeModifiable true;

DebugSwitches
{
    //SolverPerformance 0;
}
functions
{
	yPlus
	{
	   type yPlus;
	   libs ("libfieldFunctionObjects.so");
	   writeControl timeStep;
	   writeInterval 1000;
	   log yes;
	}
	
	#includeFunc "residuals"
}
