NERS570_project/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          400;
        startFace       115600;
    }
    outlet
    {
        type            patch;
        nFaces          400;
        startFace       116000;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4000;
        startFace       116400;
    }
    symm_left
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          2000;
        startFace       120400;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  symm_right;
    }
    symm_right
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          2000;
        startFace       122400;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  symm_left;
    }
)

// ************************************************************************* //
