NERS570_project/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   uniform (1.0 0 0);

boundaryField
{   
        
        inlet
        {
                type            inletOutlet;//fixedValue;//inletOutlet;
                inletValue      $internalField;
                value           $internalField;
        }
        outlet
        {
                type            inletOutlet;
                inletValue      $internalField;
                value           $internalField;
        }
        wall
        {
                type            noSlip;//fixedValue;
                //value           uniform ( 0 0 0 );
        }
	"(symm_.*)"
	{
		//type	symmetryPlane;
		type cyclic;
	}

}


// ************************************************************************* //
