NERS570_project/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   uniform 0;

boundaryField
{

        inlet
        {
                type            outletInlet;
                outletValue      $internalField;
                value           $internalField;
        }
        outlet
        {
                type            outletInlet;
                outletValue      $internalField;
                value           $internalField;
        }
        wall
        {
                type            zeroGradient;
        }
        "(symm_.*)"
        {
                //type    symmetryPlane;
		type cyclic;
        }

}


// ************************************************************************* //
