NERS570_project/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.00375;
// k0 = 3/2*I^2*U^2, I=5% assumed
boundaryField
{

        inlet
        {
                type            inletOutlet;
                inletValue      $internalField;
                value           $internalField;
        }
        outlet
        {
                type            inletOutlet;
                inletValue      $internalField;
                value           $internalField;
        }
        wall
        {
                type            kqRWallFunction;
                value           $internalField;
        }
        "(symm_.*)"
        {
                //type    symmetryPlane;
		type cyclic;
        }

}


// ************************************************************************* //
