NERS570_project/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{

        inlet
        {
                type            calculated;
                value           $internalField;
        }
        outlet
        {
                type            calculated;
                value           $internalField;
        }
        wall
        {
                type            nutkWallFunction;
                value           $internalField;
        }
        "(symm_.*)"
        {
                //type    symmetryPlane;
		type cyclic;
        }

}


// ************************************************************************* //
