NERS570_project/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.00559017;
// omega = k0^0.5 / 0.09^0.25 / Length, Length = (x_out - x_in)

boundaryField
{

        inlet
        {
                type            inletOutlet;
                inletValue      $internalField;
                value           $internalField;
        }
        outlet
        {
                type            inletOutlet;
                inletValue      $internalField;
                value           $internalField;
        }
        wall
        {
                type            omegaWallFunction;
                value           $internalField;
        }
        "(symm_.*)"
        {
                //type    symmetryPlane;
		type cyclic;
        }

}

// ************************************************************************* //
