NERS570_project/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         				none;
    div(phi,U)      				bounded Gauss linearUpwindV grad(U);
    div(phi,k)      				bounded Gauss upwind;
    div(phi,omega)  				bounded Gauss upwind;
	div(phi,nuTilda)  				bounded Gauss upwind;
    div((nuEff*dev2(T(grad(U))))) 	Gauss linear;
	div(pc)                         bounded Gauss upwind;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p;
    Phi;
}
wallDist
{
    method          meshWave;
}

// ************************************************************************* //
